'''       添加反斜杆        '''
#如
print('\\dd')
#或
print(r"\dd")
#另，print(r'\')不可以
'''         斜杆作用       '''
#如  表示未结束
print("                 \n\
         0               \n\
        / \               \n\
       /   \               \n\
       .....              \n\
      .......            \n\
      '''''''            \n\
    ||||||||||           \n\n\n")               
#还可以
x = ('''                 
         0               
        / \               
       /   \               
       .....              
      .......            
      '''''''            
    ||||||||||           ''')
print(x)
