#格式化字符串3
print("{0:+} {0:-} {0: }".format(530))
print("{0:+} {0:-} {0: }".format(-530))
# + 号为通通加  - 号为默认，仅符号加  “ ”空格为正数加空格，负数加负号

#使用 _ , 为千分位分割符
print("{0:,} {0:_}".format(6790))

#精度
#f F限定小数点后几位  g G是限定前后共几位  非数字类型为限定字符串大小
print("{:.4f}".format(3.1415926))
print("{:.4g}".format(3.1415926))
print("{:.4}".format("横扫饥饿，做回自己"))
#精度选项禁止应用于整数上

#type类型
# b 二进制输出  c 将参数以Unicode字符输出  d 十进制输出  o 十八进制输出
# xX 十六进制输出  None与d一样
print("{:#b}".format(1040))
print("{:c}".format(1040))
print("{:#o}".format(1040))
#加井号可以添加前缀

#剩余看鱼c字符串语法参考
print("{:.{led}}".format(33.1420000,led=3))
# “.” + “数字” 为设置精度   {led}为利用关键字参数将精度值导入
#混合运用
# +填充 ^居中 长度为10 精度为3 使用g
print("{:+^10.3g}".format(3.3838))
#进阶
print("{:{a}{b}{c}.{d}{e}}".format(3.3838,a="+",b="^",c=10,d=3,e="g"))


#f字符串 语法糖
print(f"{3.3838:010}")
print(f"{3.3838:0<10.3g}")
#若要代数format更好
